import codecs
from first import Exhaustive

hlist=[]
with codecs.open('/Users/hp/Desktop/hindi stopwords.txt',encoding='utf=8') as f:
    t=f.read()
hlist=t.split('\r\n')

text = list()
text = "संस्कृत में एक श्लोक है- 'यस्य पूज्यंते नार्यस्तु तत्र रमन्ते देवता:। अर्थात्, जहां नारी की पूजा होती है, वहां देवता निवास करते हैं। भारतीय संस्कृति में नारी के सम्मान को बहुत महत्व दिया गया है। किंतु वर्तमान में जो हालात दिखाई देते हैं, उसमें नारी का हर जगह अपमान होता चला जा रहा है। उसे 'भोग की वस्तु' समझकर आदमी 'अपने तरीके' से 'इस्तेमाल' कर रहा है। यह बेहद चिंताजनक बात है। लेकिन हमारी संस्कृति को बनाए रखते हुए नारी का सम्मान कैसे किया जाए, इस पर विचार करना आवश्यक है।मां अर्थात माता के रूप में नारी, धरती पर अपने सबसे पवित्रतम रूप में है। माता यानी जननी। मां को ईश्वर से भी बढ़कर माना गया है, क्योंकि ईश्वर की जन्मदात्री भी नारी ही रही है। मां देवकी (कृष्ण) तथा मां पार्वती (गणपति/ कार्तिकेय) के संदर्भ में हम देख सकते हैं इसे। किंतु बदलते समय के हिसाब से संतानों ने अपनी मां को महत्व देना कम कर दिया है। यह चिंताजनक पहलू है। सब धन-लिप्सा व अपने स्वार्थ में डूबते जा रहे हैं। परंतु जन्म देने वाली माता के रूप में नारी का सम्मान अनिवार्य रूप से होना चाहिए, जो वर्तमान में कम हो गया है, यह सवाल आजकल यक्षप्रश्न की तरह चहुंओर पांव पसारता जा रहा है। इस बारे में नई पीढ़ी को आत्मावलोकन करना चाहिए।"
text = text.split("।")
text = [x.lstrip() for x in text]
text = [x.rstrip() for x in text]
exhm = Exhaustive(tokens=text)
exhm.wstop=hlist
ktop = exhm.KTopRanks(k=2)
for s, wt in ktop:
    print(s)